// 1. 'number' + 3 + 3
// 'number' — це рядок, а рядок + число перетворить число також в рядок
console.log('number' + 3 +3); // number33


// 2. null + 3
// null це фактично 0, тому тут арифметичний вираз
// 0 + 3 = 3
console.log(null + 3); // 3

// 3. 5 && "qwerty"

// Крок 1: значення 5- істинне значення
// Крок 2: тому && повертає друге значення "qwerty"
console.log(5 && "qwerty"); // qwerty


// 4. +'40' + +'2' + "hillel"
// Крок 1: знак + перетворює рядок на число, тому отримуємо число 40
// Крок 2: +'2' отримуємо число 2
// Крок 3: сума 42 + рядок дорівнюватиме рядку
console.log(+'40' + +'2' + "hillel"); // 42hillel


// 5. '10' - 5 === 6

// Крок 1: '10' перетворюється на число 10
// Крок 2: 10 - 5 = 5
// Крок 3: 5 === 6 → false
console.log('10' - 5 === 6); // false


// 6. true + false

// Крок 1: true = 1
// Крок 2: false = 0
// Крок 3: 1 + 0 = 1
console.log(true + false); // 1


// 7. '4px' - 3

// Крок 1: '4px' не можна перетворити на число, отримуємо NaN
// Крок 2:  NaN - 3 = NaN
console.log('4px' - 3); // NaN


// 8. '4' - 3

// Крок 1: '4' перетворюється на число 4
// Крок 2: 4 - 3 = 1
console.log('4' - 3); // 1


// 9. '6' + 3 ** 0

// Крок 1: спочатку степінь: 3 ** 0 = 1
// Крок 2: '6' + 1 дає рядок "61"
console.log('6' + 3 ** 0); // 61


// 10. 12 / '6'

// Крок 1: ділення перетворює '6' на число 6
// Крок 2: 12 / 6 = 2
console.log(12 / '6'); // 2


// 11. '10' + (5 === 6)

// Крок 1: спочатку дужки 5 === 6 -дає false
// Крок 2: '10' + false = "10false"
console.log('10' + (5 === 6)); // 10false


// 12. null == ''

// Крок 1: null це не 0, може прирівнюватись до undefined
// Крок 2: '' пустий рядок це 0
console.log(null == ''); // false


// 13. 3 ** (9 / 3)

// Крок 1: дужки виконуються першими, тому 9 / 3 = 3
// Крок 2: 3 в степені 3 = 27
console.log(3 ** (9 / 3)); // 27


// 14. !!'false' == !!'true'

// Крок 1: будь-який непорожній рядок є true
// Крок 2: !'false' = false, !!'false' = true
// Крок 3: !'true' = false, !!'true' = true
// Крок 4: true == true це true
console.log(!!'false' == !!'true'); // true


// 15. 0 || '0' && 1

// Крок 1: && має вищий пріоритет, повертає другий операнд, якщо перше значення дійсне
// Крок 2: '0' — true, тому '0' && 1 = 1
// Крок 3: 0 || 1 = 1 - повертає перше дійсне значення
console.log(0 || '0' && 1); // 1


// 16. (+null == false) < 1

// Крок 1: +null = 0
// Крок 2: 0 == false дає true
// Крок 3: true це 1
// Крок 4: 1 < 1 виходить false
console.log((+null == false) < 1); // false


// 17. false && true || true

// Крок 1: false && true = false
// Крок 2: false || true = true
console.log(false && true || true); // true


// 18. false && (false || true)

// Крок 1: у дужках false || true = true
// Крок 2: false && true = false
console.log(false && (false || true)); // false


// 19. (+null == false) < 1 ** 5

// Крок 1: +null = 0
// Крок 2: 0 == false це true
// Крок 3: 1 ** 5 = 1
// Крок 4: true = 1
// Крок 5: 1 < 1 це false
console.log((+null == false) < 1 ** 5); // false